- **Pandas has two types of data structure:**
-a) **Series -** <i>dd</i>

In [36]:
import numpy as np
import pandas as pd

In [4]:
dict1 = {
    "name" : ['shubham', 'shruti', 'dipta', 'stark'],
    "marks" : [92, 89, 99, 90],
    "city" : ['Dumka', 'Aurangabad', 'Notun Parulia', 'Ranga']
}

In [5]:
df = pd.DataFrame(dict1)

In [6]:
df

      name  marks           city
0  shubham     92          Dumka
1   shruti     89     Aurangabad
2    dipta     99  Notun Parulia
3    stark     90          Ranga

In [10]:
df.to_csv('love.csv')
df.to_csv('love_no_index.csv', index=False) # without index

In [11]:
df.head(2) # get first elements

      name  marks        city
0  shubham     92       Dumka
1   shruti     89  Aurangabad

In [13]:
df.tail(2) # get last elements

    name  marks           city
2  dipta     99  Notun Parulia
3  stark     90          Ranga

In [15]:
df.describe()  # describe number details in DataFrame

          marks
count   4.00000
mean   92.50000
std     4.50925
min    89.00000
25%    89.75000
50%    91.00000
75%    93.75000
max    99.00000

In [25]:
shubham = pd.read_csv('shubham.csv') #import local csv

In [26]:
shubham

   Train No  Speed       City
0       123     34  Rampurhat
1      1232     35      Dumka
2        22     70    Kolkata
3      4331     99      Japan

In [28]:
shubham['Speed'][0]

34

In [ ]:
shubham['Speed'][0] = 50

In [30]:
shubham

   Train No  Speed       City
0       123     50  Rampurhat
1      1232     35      Dumka
2        22     70    Kolkata
3      4331     99      Japan

In [31]:
shubham.to_csv('shubham.csv')

In [34]:
# Change index
shubham.index = ['a', 'b', 'c', 'd']

In [35]:
shubham

   Train No  Speed       City
a       123     50  Rampurhat
b      1232     35      Dumka
c        22     70    Kolkata
d      4331     99      Japan